# JoulesPerKelvin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..JoulesPerKelvin Property
UnitTypeId Class See Also
---
Joules per Kelvin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId JoulesPerKelvin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JoulesPerKelvin As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JoulesPerKelvin {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace